{
  "theRetrospect:MysteriousProphetEvent": {
    "NAME": "Mysterious Prophet",
    "DESCRIPTIONS": [
      "While moving through a dark corridor, you are suddenly #p~blinded~ by a bright light. NL NL A voice emanated from above. NL NL \"Many have set foot on the Spire across different timelines. Some have already succeeded before you...\"",
      "\"I can foresee your victory, but you must learn from the great ones before you.\" NL NL The light disappeared, and you stare at the old figure with disbelief.",
      "\" #pI #pcontrol #pmy #pown #ptime. Prophecy is for the uninitiated.\" NL NL You left with confidence.",
      "The prophet offers you 4 #p~books~ #p~of~ #p~knowledge~ . NL NL \"Pick one, and don't give up until you master the spirit.\"",
      "You humbly accepted his offer, and the prophet left with a grin."
    ],
    "OPTIONS": [
      "[Listen on]",
      "[Stay]",
      "[Ignore]",
      "[Leave]",
      "[Book of Demons] Gain #rSoulless #rDemon",
      "[Book of Transformation] Gain #gNoxious #gWraith",
      "[Book of Automation] Gain #bDefective #bEcho",
      "[Book of Divinity] Gain #pDivine #pEye"
    ]
  },
  "theRetrospect:Ghosts": {
    "NAME": "Council of Ghosts",
    "DESCRIPTIONS": [
      "As you continue your ascent, #p~thick~ #p~black~ #p~smoke~ begins to billow out of the ground and walls around you, coalescing into three masked forms that start to speak. NL NL ~\"Another~ ~puppet~ ~of~ #y~Neow~ ~I~ ~think.\"~ NL #r@\"AGREED!@ #r@SHE@ #r@ALWAYS@ #r@MAKES@ #r@THE@ #r@FUNNEST@ #r@TOYS!\"@ NL NL You notice an over-sized grin as the third addresses you. NL \"Ignore the others... Would you like a taste of our #y~power?\"~ ",
      "",
      "#y\"Excellent!\" NL As the ghostly shape speaks, you notice its large mouth opening wider and wider. #p~Thick~ #p~black~ #p~smoke~ spews forth and envelops the room. You cannot see or breathe... NL NL Just before you lose consciousness, the sensation stops. NL NL Whatever those things were, they are gone now. You continue on, feeling rather #bhollow.",
      "\"How disappointing...\" NL ~\"You~ ~will~ ~join~ ~us~ ~sooner~ ~or~ ~later.\"~ NL #r@\"HA@ #r@HA@ #r@HA@ #r@HAHAHA!\"@ NL NL The shapes fade away, leaving only the unnerving laughter ringing in your ears.",
      ""
    ],
    "OPTIONS": [
      "[Accept] #gReceive #g3 Apparition. #rLose #r",
      " #rMax #rHP.",
      "[Refuse]",
      "[Accept] #gReceive #g2 Apparition. #rLose #r",
      "",
      "[Leave]"
    ]
  }
}