{
  "theRetrospect:MysteriousProphetEvent": {
    "NAME": "Mysterious Prophet",
    "DESCRIPTIONS": [
      "While moving through a dark corridor, you are suddenly #p~blinded~ by a bright light. NL NL A voice emanates from above. NL \"Many have set foot on the Spire across different timelines. Some have already succeeded before you...\"",
      "\"I can foresee your victory, but you must learn from the great ones before you.\" NL NL The light disappears, and you stare at the old figure with disbelief.",
      "\" #pI #pcontrol #pmy #pown #ptime. Prophecy is for the uninitiated.\" NL NL You leave with confidence.",
      "The prophet offers you 4 #p~books~ #p~of~ #p~knowledge~ . NL NL \"Pick one, and don't give up until you master the spirit.\"",
      "You humbly accepts his offer, and the prophet leaves with a grin."
    ],
    "OPTIONS": [
      "[Listen on]",
      "[Stay]",
      "[Ignore]",
      "[Leave]",
      "[Book of Demons] Receive #rSoulless #rDemon",
      "[Book of Transformation] Receive #gNoxious #gWraith",
      "[Book of Automation] Receive #bDefective #bEcho",
      "[Book of Divinity] Receive #pDivine #pEye"
    ]
  },
  "theRetrospect:Ghosts": {
    "NAME": "Council of Ghosts",
    "DESCRIPTIONS": [
      "As you continue your ascent, #p~thick~ #p~black~ #p~smoke~ begins to billow out of the ground and walls around you, coalescing into three masked forms that start to speak. NL NL ~\"Another~ ~puppet~ ~of~ #y~Neow~ ~I~ ~think.\"~ NL #r@\"AGREED!@ #r@SHE@ #r@ALWAYS@ #r@MAKES@ #r@THE@ #r@FUNNEST@ #r@TOYS!\"@ NL NL You notice an over-sized grin as the third addresses you. NL \"Ignore the others... Would you like a taste of our #y~power?\"~ ",
      "",
      "#y\"Excellent!\" NL As the ghostly shape speaks, you notice its large mouth opening wider and wider. #p~Thick~ #p~black~ #p~smoke~ spews forth and envelops the room. You cannot see or breathe... NL NL Just before you lose consciousness, the sensation stops. NL NL Whatever those things were, they are gone now. You continue on, feeling rather #bhollow.",
      "\"How disappointing...\" NL ~\"You~ ~will~ ~join~ ~us~ ~sooner~ ~or~ ~later.\"~ NL #r@\"HA@ #r@HA@ #r@HA@ #r@HAHAHA!\"@ NL NL The shapes fade away, leaving only the unnerving laughter ringing in your ears.",
      ""
    ],
    "OPTIONS": [
      "[Accept] #gReceive #g3 Apparition. #rLose #r",
      " #rMax #rHP.",
      "[Refuse]",
      "[Accept] #gReceive #g2 Apparition. #rLose #r",
      "",
      "[Leave]"
    ]
  },
  "theRetrospect:EventHorizonEvent": {
    "NAME": "Event Horizon",
    "DESCRIPTIONS": [
      "As you walk through a secluded area, you hear a ~loud~ ~hum~ originating somewhere nearby. NL You approach the noise to investigate further, only to discover a miniature #p~black~ #p~hole~ destroying everything in the perimeter! NL NL The immense gravity distorts all objects and #rpulls #ryou #rtowards #rthe #rcenter. NL You have to make a move before you reach the #pevent #phorizon. NL What do you do?",
      "You know that the black hole's ~immense~ ~power~ will be of great help in your ascent. NL NL Moments before you get disintegrated by gravity, you pull out a magic bottle and #ysuccessfully #ycapture its core. NL NL With the black hole inside, the bottle is now #rforever #rstuck #rto #ryour #rhand, but at the same time, you feel #ga #gsurge #gof #gpower like nothing you have experienced before.",
      "The black hole is #rtoo #rstrong to run away from. You activate your wrist-mounted device just in time to #pphase #paway. NL NL In the blink of an eye, you arrive safely at a timeline where you have never approached the black hole. NL Feeling relieved, you continue your ascent like nothing has ever happened."
    ],
    "OPTIONS": [
      "[Capture] Gain #yBottled #ySingularity and #rreceive #ra #runique #rCurse.",
      "[Escape]",
      "[Leave]"
    ]
  },
  "theRetrospect:FutureGadgetsEvent": {
    "NAME": "Future Gadgets",
    "DESCRIPTIONS": [
      "You are walking on a straight and open road, feeling rather tired. NL Suddenly, a man appears out of nowhere and stands right in front of you, blocking your path forward. NL NL \" ~Do~ ~you~ ~call~ ~yourself~ ~an~ ~adventurer?~ Do you dare to harness the power of #p~future~ #p~gadgets?~ \"",
      "He hands you a wrist-mounted device with a #ptesseract core. NL \"Enjoy the #r~unprecedented~ #r~strength~ .\" NL NL As you wear the device, your concept of time starts to fade, and your consciousness separates from your body...",
      "\"Foolish mortals.\" NL He vanishes without a trace."
    ],
    "OPTIONS": [
      "[Yes] Receive #yDivert.",
      "[No]",
      "[Leave]"
    ]
  },
  "theRetrospect:BlankCanvasEvent": {
    "NAME": "Blank Canvas",
    "DESCRIPTIONS": [
      "An old man approaches you with a cunning smile, holding a blank card with both of his hands. NL NL \"This card is different from ~anything~ you've seen before, because this card is ~whatever~ you want it to be. But...\" NL NL He leans closer. NL NL \"...for your words to take effect, you need to write them with #r~blood~ \"",
      "The words you wrote become engraved in the card. This takes a lot more effort than you thought.",
      "The card is #rdraining #ryour #rblood #rfast. Your hand is aching.",
      "The card seems to be #rglowing #rred. Your eyes are #rlosing #rfocus.",
      "Your field of vision is #rfilled #rwith #rred. The text on the card starts to float around you.",
      "You ignore the man and leave, but he has already slipped the card into your pocket.",
      "You wanted to write more, but you decide to not be too greedy.",
      "There is no more space on the card. NL NL You are completely frazzled, but you convince yourself that it is worth the effort."
    ],
    "OPTIONS": [
      "[Take the card and leave]",
      "[Add text to the card] \" ",
      " \" - #rLose #r",
      " #rHP",
      "[Leave]",
      " Energy",
      " Energy",
      " - TRANSLATOR NOTE: - The above line is for plural if needed to distinguish from singular."
    ]
  }
}